# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 4. Discover what is the mean age per occupation

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
Name: age, dtype: float64

                age
occupation
administrator  38.7
artist         31.4
doctor         43.6
educator       42.0
engineer       36.4
entertainment  29.2
executive      38.7
healthcare     41.6

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

occupation     gender
administrator  M          54.0
               F          46.0
artist         M          54.0
               F          46.0
doctor         M         100.0
educator       M          73.0
               F          27.0
engineer       M          97.0
Name: gender, dtype: float64

pandas.core.series.Series

MultiIndex([('administrator', 'M'),
            ('administrator', 'F'),
            (       'artist', 'M'),
            (       'artist', 'F'),
            (       'doctor', 'M'),
            (     'educator', 'M')],
           names=['occupation', 'gender'])

occupation
doctor        100.0
engineer       97.0
technician     96.0
retired        93.0
executive      91.0
Name: gender, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70

### Step 7. For each combination of occupation and gender, calculate the mean age

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000

### Step 8.  For each occupation present the percentage of women and men

occupation     gender
administrator  M          54.0
               F          46.0
artist         M          54.0
               F          46.0
doctor         M         100.0
educator       M          73.0
               F          27.0
engineer       M          97.0
Name: gender, dtype: float64